{"class_name": "Model", "keras_version": "1.1.1", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 160, 63], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Masking", "config": {"trainable": true, "mask_value": 0.0, "name": "masking_1"}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "masking_1"}, {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "lstm_1", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 63, "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 64, "forget_bias_init": "one", "input_length": null}, "inbound_nodes": [[["masking_1", 0, 0]]], "name": "lstm_1"}, {"class_name": "Dropout", "config": {"p": 0, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["lstm_1", 0, 0]]], "name": "dropout_1"}, {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "lstm_2", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 64, "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 64, "forget_bias_init": "one", "input_length": null}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "lstm_2"}, {"class_name": "Dropout", "config": {"p": 0, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["lstm_2", 0, 0]]], "name": "dropout_2"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 63}}, "trainable": true, "name": "timedistributed_1"}, "inbound_nodes": [[["dropout_2", 0, 0]]], "name": "timedistributed_1"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["timedistributed_1", 0, 0]]], "name": "activation_1"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["activation_1", 0, 0]], "name": "model_1"}}