____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)             (None, 160, 63)       0                                            
____________________________________________________________________________________________________
masking_1 (Masking)              (None, 160, 63)       0           input_1[0][0]                    
____________________________________________________________________________________________________
lstm_1 (LSTM)                    (None, 160, 64)       32768       masking_1[0][0]                  
____________________________________________________________________________________________________
dropout_1 (Dropout)              (None, 160, 64)       0           lstm_1[0][0]                     
____________________________________________________________________________________________________
lstm_2 (LSTM)                    (None, 160, 64)       33024       dropout_1[0][0]                  
____________________________________________________________________________________________________
dropout_2 (Dropout)              (None, 160, 64)       0           lstm_2[0][0]                     
____________________________________________________________________________________________________
timedistributed_1 (TimeDistribute(None, 160, 63)       4095        dropout_2[0][0]                  
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 160, 63)       0           timedistributed_1[0][0]          
====================================================================================================
Total params: 69887
____________________________________________________________________________________________________
